Repository: FunProgramer/vocabulary-trainer-app
Catalog: lib/l10n/intl_*.arb
Languages: de

# loadingNotStarted
source: Loading not started. Will be started soon.
de: Das Laden wurde noch nicht gestartet. Es wird bald gestartet.

source: An error occurred
de: Ein Fehler ist aufgetreten

# moreInfoError
source: More info: {errorString}
de: Weitere Informationen: {errorString}

# aboutApp
source: About this app
de: Über diese App

# appDescription
source: An app to learn vocabularies, developed with flutter.
de: Eine App zum Lernen von Vokabeln, entwickelt mit Flutter

# author
source: Created by FunProgramer
de: Erstellt von FunProgramer

# errorOpenGitHub
source: Couldn't open the GitHub Website.
de: Die GitHub Website konnte nicht geöffnet werden.

source: Copy URL
de: URL kopieren

source: Source Code
de: Quell Code

# questionLanguageDirection
source: In which language direction do you want to learn the vocabulary?
de: In welche Sprachrichtung möchtest du die Vokabeln lernen?

# randomForVocabulary
source: Random for each vocabulary
de: Zufällig für jede Vokabel

# questionExerciseOrder
source: In which order to you want to learn the vocabulary?
de: In welcher Reihenfolge möchtest du die Vokabeln lernen?

source: Standard order
de: Standard Reihenfolge

source: Random order
de: Zufällige Reihenfolge

source: BACK
de: ZURÜCK

source: START TRAINING
de: TRAINING BEGINNEN

source: NEXT
de: WEITER

source: Learn vocabularies
de: Vokabeln lernen

# deleteVocabularyCollections
source: {howMany, plural, one{Delete Vocabulary Collection?} other{Delete {howMany} Vocabulary Collections?}}
de: {howMany, plural, one{Vokabel Sammlung löschen?} other{{howMany} Vokabel Sammlungen löschen?}}

# deleteVocabularyCollectionsFull
source: {howMany, plural, one{Are you sure to delete a Vocabulary Collection?} other{Are you sure to delete {howMany} Vocabulary Collections?}}
de: {howMany, plural, one{Bist du dir sicher, dass du eine Vokabel Sammlung löschen möchtest?} other{Bist du dir sicher, dass du {howMany} Vokabel Sammlungen löschen möchtest?}}

source: NO
de: NEIN

source: YES
de: JA

# deletingVocabularyCollection
source: Delete Vocabulary Collection
de: Vokabel Sammlung löschen

source: Deleting
de: Wird gelöscht

source: Loading data...
de: Daten werden geladen...

source: No collections
de: Keine Sammlungen

# addCollectionHint
source: Click on the plus icon in the bottom right corner to add one.
de: Klicke auf das Plus-Symbol in der unteren rechten Ecke um eine hinzuzufügen.

# selectionInfo
source: {selectionLength} selected
de: {selectionLength} ausgewählt

source: Import Vocabulary Collection
de: Vokabel Sammlung importieren

source: Importing
de: Wird importiert

# successfulImport
source: Successfully imported Vocabulary Collection
de: Die Vokabel Sammlung wurde erfolgreich importiert

source: Collection Details
de: Details der Sammlung

source: Reading file...
de: Datei wird gelesen...

source: Not available
de: Nicht verfügbar

# filePickingAborted
source: User aborted file picking. Navigating back to previous page in a few seconds...
de: Der Benutzer hat die Datei-Auswahl abgebrochen. In ein paar Sekunden wird zurücknavigiert...

# noData
source: No data found. That usually means, that the vocabulary collection does not exist.
de: Keine Daten gefunden. Das bedeutet normalerweise, dass die Vokabel Sammlung nicht existiert

# brokenFile
source: The provided JSON-File is not in the correct format.
de: Die angegebene JSON-Datei is nicht im richtigen Format.

# collectionNotImported
source: Collection currently not imported. Click on the import icon in the bar above, to import this collection.
de: Sammlung aktuell nicht importiert. Klicke auf das Importieren-Icon in der Leiste oben, um diese Sammlung zu importieren.

# vocabularyCount
source: {vocabularyLength} Vocabularies
de: {vocabularyLength} Vokabeln

source: SKIP
de: ÜBERSPRINGEN

source: SUBMIT
de: ÜBERPRÜFEN

# skippedExercise
source: You skipped this exercise.
de: Du hast diese Übung übersprungen

# correctAnswer
source: Correct answer: {requestedAnswer}
de: Richtige Antwort: {requestedAnswer}

# correctAnswerInfo
source: Correct answer!
de: Richtige Antwort!

source: Wrong answer!
de: Falsche Antwort!

# originalAnswer
source: Original answer: {requestedAnswer}
de: Ursprüngliche Antwort: {requestedAnswer}
